vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN947_DFP.pdsc
            __errorcontrol = 1;
            
            // Set watch point
            Write32(0xE0001020, 0x00000000);
            Write32(0xE0001028, 0x412);
            Write32(0xE0001030, 0x00FFFFFF);
            Write32(0xE0001038, 0x403);
            
            Write32(0xE0001040, 0x80000000);
            Write32(0xE0001048, 0x412);
            Write32(0xE0001050, 0x8FFFFFFF);
            Write32(0xE0001058, 0x403);
            
            // De-assert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>
          <control if="!canReadPins">
            <block>
              // Assert nRESET line
              DAP_SWJ_Pins(nReset, nReset, 0);
            </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
          <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
            <block>Sequence("WaitForStopAfterReset");</block>
          </control>
        </sequence>
        <sequence name="ResetSystemCore0">
          <block>
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var tmp;
            
            __var ap0_disable=0x55aa;
            
            //Halt the core
            Write32(DHCSR_Addr, 0xA05F0003);
            //clear VECTOR CATCH and set TRCENA
            tmp = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, tmp | 0x1000000);
            
            __errorcontrol = 1;
            
            // Set watch point
            Write32(0xE0001020, 0x00000000);
            Write32(0xE0001028, 0x412);
            Write32(0xE0001030, 0x00FFFFFF);
            Write32(0xE0001038, 0x403);
            
            Write32(0xE0001040, 0x80000000);
            Write32(0xE0001048, 0x412);
            Write32(0xE0001050, 0x8FFFFFFF);
            Write32(0xE0001058, 0x403);
            
            // reinit clock
            Write32(0x40000220, 0x401);
            Write32(0x40000140, 0x401);
            Write32(0x40000220, 0xE000);
            Write32(0x40000140, 0xE000);
            
            __errorcontrol = 1;
            // Execute SYSRESETREQ via AIRCR
            Write32(AIRCR_Addr, 0x05FA0004);
            
            __errorcontrol = 0;
            
            // Give bootloader time to do what it needs to do
            DAP_Delay(BootTime);  // try 1000ms
            
            // Read AP0 CSW
            __dp = 0;
            __ap = 0;
            ap0_disable = ReadAP(0x0);
            ap0_disable = ((ap0_disable &amp; 0x40) == 0);
            ////Message(0, "AP0 DIS: %x", ap0_disable);
            
            Sequence("WaitForStopAfterReset");
          </block>
        </sequence>
        <sequence name="ResetProcessorCore1">
          <block>
            __var SYSCON_NS_Base_Addr = 0x40000000;
            __var CPUCTRL_Addr        = SYSCON_NS_Base_Addr + 0x800;
            __var value               = 0;
            __var apOrg               = __ap;
            
            __ap = 0;                           // Switch to CPU0 AP to drive CPU1 reset via CPUCTRL register
            
            value      = Read32(CPUCTRL_Addr);  // Read CPUCTRL Register
            value &amp;= 0x0000FFFF;            // Preserve previous settings
            value     |= 0xC0C40000;            // Set key value
            value     |= 0x00000028;            // Set CPU1CLKEN and CPU1RSTEN
            Write32(CPUCTRL_Addr, value);       // Put CPU1 into reset
            
            value &amp;= ~0x00000020;           // Clear CPU1RSTEN
            Write32(CPUCTRL_Addr, value);       // Release CPU1 from reset
            
            __ap = apOrg;
          </block>
        </sequence>
        <sequence name="TraceStart">
          <control if="__traceout &amp; 0x1" info="SWO Trace output selected">
            <block>Sequence("EnableTraceClk");       // Enable and configure trace clock</block>
            <control if="SWO_Pin == 0" info="SWO via PIO0_2">
              <block>Write32(0x40116088, 0x00001140); // PIO0_2 PORT0_PCR2 mux to SWO</block>
            </control>
          </control>
        </sequence>
      </sequences>
      <debugvars configfile="devices/MCXN947/arm/MCXN9XX.dbgconf">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var SWO_Pin               = 0;                    // Serial Wire Output pin: 0 = PIO0_2
        __var Dbg_CR                = 0x00000000;           // DBG_CR
        __var BootTime              = 1000000;              // 1000 milliseconds
      </debugvars>
      <description>
        150 MHz Arm® Dual Cortex-M33 TrustZone® microcontroller for Industrial and Consumer IoT Applications.
      </description>
      <device Dname="MCXN947">
        <processor Pname="cm33_core0" Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="DSP" Dendian="Little-endian" Dclock="150000000"/>
        <processor Pname="cm33_core1" Dcore="Cortex-M33" Dfpu="NO_FPU" Dmpu="NO_MPU" Dtz="NO_TZ" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="150000000"/>
        <environment Pname="cm33_core0" name="iar">
          <file category="linkerfile" name="devices/MCXN947/iar/MCXN947_cm33_core0_flash.icf"/>
        </environment>
        <environment Pname="cm33_core1" name="iar">
          <file category="linkerfile" name="devices/MCXN947/iar/MCXN947_cm33_core0_flash.icf"/>
        </environment>
        <sequences>
          <sequence name="ResetSystem" Pname="cm33_core0">
            <block>Sequence("ResetSystemCore0");</block>
          </sequence>
          <sequence name="ResetSystem" Pname="cm33_core1" disable="1"/>
          <sequence name="ResetProcessor" Pname="cm33_core0" disable="1"/>
          <sequence name="ResetProcessor" Pname="cm33_core1">
            <block>Sequence("ResetProcessorCore1");</block>
          </sequence>
        </sequences>
        <memory name="BootROM" start="0x03000000" size="0x040000" access="rx"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x040000" access="rx" alias="BootROM"/>
        <memory name="PROGRAM_FLASH0" start="0x00000000" size="0x100000" access="rx" default="1" startup="1"/>
        <memory name="PROGRAM_FLASH1" start="0x00100000" size="0x100000" access="rx" default="1" startup="1"/>
        <memory name="PROGRAM_FLASH_alias0" start="0x10000000" size="0x100000" access="rx" alias="PROGRAM_FLASH0"/>
        <memory name="PROGRAM_FLASH_alias1" start="0x10100000" size="0x100000" access="rx" alias="PROGRAM_FLASH1"/>
        <memory name="SRAM" start="0x20000000" size="0x060000" access="rw" default="1"/>
        <memory name="SRAMH" start="0x20060000" size="0x8000" access="rw" default="1"/>
        <memory name="SRAMH_alias" start="0x30060000" size="0x8000" access="rw" alias="SRAMH"/>
        <memory name="SRAMX" start="0x04000000" size="0x018000" access="rw" default="1"/>
        <memory name="SRAMX_alias" start="0x14000000" size="0x018000" access="rw" alias="SRAMX"/>
        <memory name="SRAM_alias" start="0x30000000" size="0x060000" access="rw" alias="SRAM"/>
        <memory name="USB_RAM" start="0x400ba000" size="0x1000" access="rw" default="1"/>
        <memory name="USB_RAM_alias" start="0x500ba000" size="0x1000" access="rw" alias="USB_RAM"/>
        <algorithm name="devices/MCXN947/arm/MCXN9XX_2048.FLM" start="0x0" size="0x200000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        <algorithm name="devices/MCXN947/arm/MCXN9XX_2048_S.FLM" start="0x10000000" size="0x200000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        <algorithm name="devices/MCXN947/arm/MCXN9XX_W25Q64.FLM" start="0x80000000" size="0x800000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        <algorithm name="devices/MCXN947/arm/MCXN9XX_W25Q64_S.FLM" start="0x90000000" size="0x800000" RAMstart="0x20000000" RAMsize="0x1000" default="1"/>
        <debug svd="devices/MCXN947/MCXN947_cm33_core0.xml" Pname="cm33_core0" __dp="0" __ap="0"/>
        <debug svd="devices/MCXN947/MCXN947_cm33_core1.xml" Pname="cm33_core1" __dp="0" __ap="1"/>
        <variant Dvariant="MCXN947VDF">
          <compile Pname="cm33_core0" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VDF_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VDF_cm33_core1"/>
        </variant>
        <variant Dvariant="MCXN947VPB">
          <compile Pname="cm33_core0" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VPB_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VPB_cm33_core1"/>
        </variant>
        <variant Dvariant="MCXN947VAB">
          <compile Pname="cm33_core0" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VAB_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VAB_cm33_core1"/>
        </variant>
        <variant Dvariant="MCXN947VNL">
          <compile Pname="cm33_core0" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VNL_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VNL_cm33_core1"/>
        </variant>
        <variant Dvariant="MCXN947VKL">
          <compile Pname="cm33_core0" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VKL_cm33_core0"/>
          <compile Pname="cm33_core1" header="devices/MCXN947/fsl_device_registers.h" define="CPU_MCXN947VKL_cm33_core1"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MCXN947.internal_condition">
      <accept Dname="MCXN947VAB" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VDF" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VKL" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VNL" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.device=MCXN947.internal_condition">
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXN947.internal_condition"/>
    </condition>
