vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN947_DFP.pdsc
    <condition id="component.els_pkc.examples_hmac.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_key.condition_id">
      <require condition="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_mac_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.mac, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.mac, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_els"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_mac"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_session"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_memory.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_random_modes.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.examples_rsa.condition_id">
      <require condition="allOf.component.els_pkc.els, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.session, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.flow_protection.condition_id">
      <require condition="allOf.component.els_pkc.core, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.glikey.condition_id">
      <require condition="allOf.component.els_pkc.core, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.core, component.els_pkc.flow_protection, component.els_pkc.toolchain, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_core"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.hash.condition_id">
      <require condition="allOf.component.els_pkc.hashmodes, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.hashmodes, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_hashmodes"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.hashmodes.condition_id">
      <require condition="allOf.component.els_pkc.buffer, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.hmac.condition_id">
      <require condition="allOf.component.els_pkc.key, component.els_pkc.padding, component.els_pkc.toolchain, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.key, component.els_pkc.padding, component.els_pkc.toolchain, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_key"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_padding"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.key.condition_id">
      <require condition="allOf.component.els_pkc.buffer, component.els_pkc.ecc, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.buffer, component.els_pkc.ecc, component.els_pkc.flow_protection, component.els_pkc.memory, component.els_pkc.pre_processor, component.els_pkc.secure_counter, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_buffer"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_ecc"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_flow_protection"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_memory"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_pre_processor"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_secure_counter"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.key_derivation.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.mac.condition_id">
      <require condition="allOf.component.els_pkc.hmac, component.els_pkc.padding, component.els_pkc.toolchain, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.component.els_pkc.hmac, component.els_pkc.padding, component.els_pkc.toolchain, device=MCXN947.internal_condition">
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_hmac"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_padding"/>
      <require Cclass="MCXN947 els_pkc" Cgroup="els_pkc_toolchain"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="component.els_pkc.mac_modes.condition_id">
      <require condition="allOf.component.els_pkc.mac, device=MCXN947.internal_condition"/>
    </condition>
