vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN947_DFP.pdsc
    <condition id="component.wifi_bt_module.config.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MCXN947.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_88w8987"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw416"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_iw61x"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rw61x"/>
    </condition>
    <condition id="component.wifi_bt_module.nb_fw.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_fw.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MCXN947.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXN947.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.core_ids=cm33_core0.condition_id">
      <require condition="core_ids.cm33_core0.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33_core0.internal_condition">
      <accept Pname="cm33_core0" Dname="*"/>
    </condition>
    <condition id="allOf.core_ids=cm33_core1.condition_id">
      <require condition="core_ids.cm33_core1.internal_condition"/>
    </condition>
    <condition id="core_ids.cm33_core1.internal_condition">
      <accept Pname="cm33_core1" Dname="*"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.driver.edma4, device=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, device=MCXN947.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXN947.internal_condition"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXN947.internal_condition">
      <require condition="device_id.MCXN947.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXN947.internal_condition">
      <accept Dname="MCXN947VAB" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VDF" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VKL" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VNL" Dvendor="NXP:11"/>
      <accept Dname="MCXN947VPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.MCXN947.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="cores.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core1.internal_condition"/>
      <require condition="device_ids.MCXN947.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="cores.cm33.internal_condition"/>
      <require condition="core_ids.cm33_core0.internal_condition"/>
      <require condition="device_ids.MCXN947.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
