vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN947_DFP.pdsc
    <component Cclass="MCXN947 els_pkc" Cgroup="els_pkc_core" Cversion="1.9.0" condition="component.els_pkc.core.condition_id">
      <description>Component els_pkc.core</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Examples.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_FunctionIdentifiers.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Macros.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Platform.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Toolchain.h" projectpath="component/els_pkc/src/comps/mcuxClCore/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCore/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN947 els_pkc" Cgroup="els_pkc_crc" Cversion="1.9.0" condition="component.els_pkc.crc.condition_id">
      <description>Component crc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCrc/src/mcuxClCrc.c" projectpath="component/els_pkc/src/comps/mcuxClCrc/src"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCrc/src/mcuxClCrc_Sw.c" projectpath="component/els_pkc/src/comps/mcuxClCrc/src"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCrc/inc/mcuxClCrc.h" projectpath="component/els_pkc/src/comps/mcuxClCrc/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Constants.h" projectpath="component/els_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCrc/inc/internal/mcuxClCrc_Internal_Functions.h" projectpath="component/els_pkc/src/comps/mcuxClCrc/inc/internal"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCrc/inc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClCrc/inc/internal/"/>
      </files>
    </component>
    <component Cclass="MCXN947 els_pkc" Cgroup="els_pkc_data_integrity" Cversion="1.9.0" condition="component.els_pkc.data_integrity.condition_id">
      <description>Component els_pkc.data_integrity</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Cfg.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_Impl.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/mcuxCsslDataIntegrity_None.h" projectpath="component/els_pkc/src/comps/mcuxCsslDataIntegrity/inc"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxCsslDataIntegrity/inc/"/>
      </files>
    </component>
    <component Cclass="MCXN947 els_pkc" Cgroup="doc" Csub="doc_mcxn" Cversion="1.9.0" condition="component.els_pkc.doc.mcxn.condition_id">
      <description>Component els_pkc.doc.mcxn</description>
      <files>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00002.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00002.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00005.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00005.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00008.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00008.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00011.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00011.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00014.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00014.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00017.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00017.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00020.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00020.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00023.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00023.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00026.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00026.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00029.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00029.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00032.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00032.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00035.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00035.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00038.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00038.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00071.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00071.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00074.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00074.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00077.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00080.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00083.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00086.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00089.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00128.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00128.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00131.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00131.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00149.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00149.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00152.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00152.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00155.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00155.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00158.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00158.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00161.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00161.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00164.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00164.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00167.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00167.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00170.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00170.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00173.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00173.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00176.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00176.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00179.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00179.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00182.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00182.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00212_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00215_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00221.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00221_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00224_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00227.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00227.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00227_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00230.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00230.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00230_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00233.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00233.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00233_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00236.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00236.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00236_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00239.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00239_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00242_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00245.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00245.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00245_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00248.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00248.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00248_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00251.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00251.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00251_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00254.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00254.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00254_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00257.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00257.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00257_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00260.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00260_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00263.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00263.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00263_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00266.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00266_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00269_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00272.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00272.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00272_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00275.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00275_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00278.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00278.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00278_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00281.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00281.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00281_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00284_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00287.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00287.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00287_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00290.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00290_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00293_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00296_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00299.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00299_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00302.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00302.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00302_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00305.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00305.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00305_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00308.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00308.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00308_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00311.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00311.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00311_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00314.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00314_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00317.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00317.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00317_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00320.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00320.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00320_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00323.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00323.js" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00323_source.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00326.html" projectpath="component/els_pkc/doc/mcxn/html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00326.js" projectpath="component/els_pkc/doc/mcxn/html"/>
