vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN947_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXN947_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXN947_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core0_flash.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core0_flash_ns.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core0_flash_s.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core0_ram.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core1_flash.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core1_ram.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/arm/MCXN947_cm33_core1_ram_s.scf" version="1.0.0" projectpath="MCXN947/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core0_flash.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core0_flash_ns.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core0_flash_s.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core0_ram.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core1_flash.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core1_ram.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/gcc/MCXN947_cm33_core1_ram_s.ld" version="1.0.0" projectpath="MCXN947/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core0_flash.icf" version="1.0.0" projectpath="MCXN947/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core0_flash_ns.icf" version="1.0.0" projectpath="MCXN947/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core0_flash_s.icf" version="1.0.0" projectpath="MCXN947/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core0, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core0_ram.icf" version="1.0.0" projectpath="MCXN947/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core1_flash.icf" version="1.0.0" projectpath="MCXN947/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core1_ram.icf" version="1.0.0" projectpath="MCXN947/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33_core1, device_ids=MCXN947.condition_id" category="linkerScript" attr="config" name="devices/MCXN947/iar/MCXN947_cm33_core1_ram_s.icf" version="1.0.0" projectpath="MCXN947/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXN947" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXN947</description>
      <files>
        <file category="header" attr="config" name="devices/MCXN947/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN947/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN947/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN947/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN947/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN947/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXN947/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXN947/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXN947/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXN947_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN947/iar/startup_MCXN947_cm33_core0.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN947/gcc/startup_MCXN947_cm33_core0.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33_core0.condition_id" category="sourceAsm" attr="config" name="devices/MCXN947/arm/startup_MCXN947_cm33_core0.S" version="1.0.0" projectpath="startup/arm"/>
        <file condition="allOf.toolchains=iar, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN947/iar/startup_MCXN947_cm33_core1.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN947/gcc/startup_MCXN947_cm33_core1.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33_core1.condition_id" category="sourceAsm" attr="config" name="devices/MCXN947/arm/startup_MCXN947_cm33_core1.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXN947_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXN947_system</description>
      <files>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="sourceC" name="devices/MCXN947/system_MCXN947_cm33_core0.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core0.condition_id" category="header" name="devices/MCXN947/system_MCXN947_cm33_core0.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="sourceC" name="devices/MCXN947/system_MCXN947_cm33_core1.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33_core1.condition_id" category="header" name="devices/MCXN947/system_MCXN947_cm33_core1.h" projectpath="device"/>
        <file category="include" name="devices/MCXN947/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN947/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN947/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN947/drivers/"/>
      </files>
    </component>
