vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXN947_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MCXN947/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN947/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="sourceC" name="devices/MCXN947/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="header" name="devices/MCXN947/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN947/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN947/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN947/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN947/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448" Cversion="2.0.1" condition="driver.cs42448.condition_id">
      <description>Driver cs42448</description>
      <RTE_Components_h>
#ifndef CODEC_CS42448_ENABLE
#define CODEC_CS42448_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42448/fsl_cs42448.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42448/fsl_cs42448.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42448/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.3" condition="driver.cs42888.condition_id">
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42888/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.3.3" condition="driver.ctimer.condition_id">
      <description>CTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXN947/drivers/fsl_ctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXN947/drivers/fsl_ctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXN947/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac14" Cversion="2.0.0" condition="driver.dac14.condition_id">
      <description>DAC14 Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN947/drivers/fsl_dac14.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN947/drivers/fsl_dac14.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN947/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.1.2" condition="driver.dac_1.condition_id">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXN947/drivers/fsl_dac.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXN947/drivers/fsl_dac.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXN947/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi" Cversion="1.0.0" condition="driver.dbi.condition_id">
      <description>Driver dbi</description>
      <files>
        <file category="header" name="components/video/display/dbi/fsl_dbi.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/fsl_dbi.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi_flexio_edma" Cversion="1.0.1" condition="driver.dbi_flexio_edma.condition_id">
      <description>Driver dbi_flexio_edma</description>
      <files>
        <file category="header" name="components/video/display/dbi/flexio/fsl_dbi_flexio_edma.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/flexio/fsl_dbi_flexio_edma.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/flexio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dbi_flexio_smartdma" Cversion="1.0.1" condition="driver.dbi_flexio_smartdma.condition_id">
      <description>Driver dbi_flexio_smartdma</description>
      <files>
        <file category="header" name="components/video/display/dbi/flexio/fsl_dbi_flexio_smartdma.h" projectpath="video"/>
        <file category="sourceC" name="components/video/display/dbi/flexio/fsl_dbi_flexio_smartdma.c" projectpath="video"/>
        <file category="include" name="components/video/display/dbi/flexio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common" Cversion="1.0.0" condition="driver.dc-fb-common.condition_id">
      <description>Driver dc-fb-common</description>
      <files>
        <file category="header" name="components/video/display/dc/fsl_dc_fb.h" projectpath="video"/>
        <file category="include" name="components/video/display/dc/"/>
      </files>
    </component>
